const brigadesByCommand = {
  'ok-skhid': [
    {
      name: '92 ОМБр',
      description: 'Одна з провідних бригад Сходу.',
      image: '/images/92.png',
      type: 'сухопутні',
      category: 'механізована',
      vacancies: [
        {
          title: 'Гранатометник',
          image: '/images/vacancies/granatometnyk.jpg',
          duties: [
            'Ураження броньованих цілей противника на передовій.',
            'Підтримка піхоти в наступальних операціях.',
            'Ведення прицільного вогню по вогневих точках.',
            'Оцінка ситуації на полі бою та швидке реагування.',
            'Співпраця з командуванням для координації дій.',
            'Підтримка тилових підрозділів у разі необхідності.',
            'Дотримання правил безпеки під час використання зброї.'
          ],
          requirements: [
            'Відмінна фізична підготовка та витривалість.',
            'Точність та концентрація під час стрільби.',
            'Вміння працювати в стресових умовах.',
            'Знання основ тактики піхоти.',
            'Відповідальність і дисциплінованість.',
            'Вміння швидко приймати рішення.',
            'Готовність до довготривалої служби в польових умовах.'
          ],
          qualifications: ['Проходження курсу бойової підготовки'],
          knowledge: ['Типи гранатометів', 'Техніка прицілювання']
        },
        {
          title: 'Розвідник',
          image: '/images/vacancies/rozvidnyk.jpg',
          duties: [
            'Збір розвідувальної інформації в тилу ворога.',
            'Спостереження за ворожими переміщеннями.',
            'Передача даних командуванню оперативно та точно.'
          ],
          requirements: [
            'Висока спостережливість і витривалість.',
            'Вміння маскуватися та діяти непомітно.',
            'Фізична підготовка і витримка стресу.'
          ],
          qualifications: ['Проходження курсу розвідника'],
          knowledge: ['Тактика розвідки', 'Методи маскування', 'Виживання в польових умовах']
        },
        {
          title: 'Снайпер',
          image: '/images/vacancies/sniper.jpg',
          duties: [
            'Точкове знищення ключових цілей на відстані.',
            'Спостереження та збір інформації для підрозділу.',
            'Підтримка позицій в тилу ворога.'
          ],
          requirements: [
            'Відмінна зір і терпіння.',
            'Вміння поводитися з снайперською зброєю.',
            'Знання методів маскування та тактики.'
          ],
          qualifications: ['Курс снайпера', 'Досвід стрільби на великі дистанції'],
          knowledge: ['Оптичні приціли', 'Тактика снайперської роботи', 'Маскування']
        },
        {
          title: 'Медик',
          image: '/images/vacancies/medic.jpg',
          duties: [
            'Надання першої медичної допомоги на полі бою.',
            'Евакуація поранених до безпечних зон.',
            'Підтримка бойової спроможності підрозділу.'
          ],
          requirements: [
            'Медична освіта або відповідна підготовка.',
            'Стресостійкість та швидке реагування.',
            'Вміння працювати під вогнем.'
          ],
          qualifications: ['Курс бойового медика'],
          knowledge: ['Тактична медицина', 'Першодопомога', 'Використання турнікетів']
        }
      ]
    },
    {
      name: '54 ОМБр',
      description: 'Ударна механізована бригада, що активно бере участь у обороні регіону.',
      image: '/images/54.png',
      type: 'сухопутні',
      category: 'механізована',
      vacancies: [
        {
          title: 'Навідник-оператор',
          image: '/images/vacancies/navidnyk.jpg',
          duties: ['Наводка на ціль', 'Управління озброєнням БМП'],
          requirements: ['Зір 100%', 'Концентрація'],
          qualifications: ['Курс БМП-2'],
          knowledge: ['Системи наведення', 'Техніка стрільби']
        }
      ]
    },
    {
      name: '93 ОМБр',
      description: 'Героїчна бригада "Холодний Яр".',
      image: '/images/93.png',
      type: 'сухопутні',
      category: 'механізована',
      vacancies: [
        {
          title: 'Кулеметник',
          image: '/images/vacancies/kulemetnyk.jpg',
          duties: ['Підтримка вогнем', 'Оборона позицій'],
          requirements: ['Стійкість до навантаження'],
          qualifications: ['Курс з кулемета ПКМ'],
          knowledge: ['Обслуговування зброї', 'Тактика стрільби']
        }
      ]
    },
    
    {
      name: '74 ОРБ',
      description: 'Окрема розвідувальна бригада, що забезпечує розвіддані для командування.',
      image: '/images/74.png',
      type: 'сухопутні',
      category: 'механізована',
      vacancies: [
        {
          title: 'Розвідник',
          image: '/images/vacancies/rozvidnyk.jpg',
          duties: [
            'Збір інформації в тилу ворога.',
            'Спостереження за ворожими рухами.',
            'Передача звітів командуванню.'
          ],
          requirements: ['Висока спостережливість', 'Вміння маскуватися', 'Відмінна фізична підготовка'],
          qualifications: ['Курс розвідника'],
          knowledge: ['Тактика ведення розвідки', 'Виживання в польових умовах']
        }
      ]
    },

  ],

  'ok-zakhid': [
    {
      name: '128 ОГШБр',
      description: 'Королі гір і бойових дій.',
      image: '/images/128.png',
      type: 'сухопутні',
      category: 'гірська штурмова',
      vacancies: [
        {
          title: 'Снайпер',
          image: '/images/vacancies/sniper.jpg',
          duties: ['Точкове знищення цілей', 'Спостереження'],
          requirements: ['Влучність', 'Терпіння'],
          qualifications: ['Снайперський курс'],
          knowledge: ['Оптика', 'Маскування']
        }
      ]
    },
    {
      name: '24 ОМБр',
      description: 'Легендарна "Королева полігонів".',
      image: '/images/24.png',
      type: 'сухопутні',
      category: 'механізована',
      vacancies: [
        {
          title: 'Снайпер',
          image: '/images/vacancies/sniper.jpg',
          duties: ['Точкове знищення цілей', 'Спостереження'],
          requirements: ['Влучність', 'Терпіння'],
          qualifications: ['Снайперський курс'],
          knowledge: ['Оптика', 'Маскування']
        }
      ]
    },
    {
      name: '10 ОГШБр',
      description: 'Окрема гірсько-штурмова бригада, спеціалізується на операціях у гірській місцевості.',
      image: '/images/brigade13.png',
      type: 'сухопутні',
      category: 'гірська штурмова',
      vacancies: [
        {
          title: 'Гірський стрілець',
          image: '/images/vacancies/hirskyi.jpg',
          duties: ['Штурм у складній місцевості', 'Маневрування на висотах'],
          requirements: ['Висока фізична форма', 'Стійкість до гірського клімату'],
          qualifications: ['Гірська підготовка'],
          knowledge: ['Альпінізм', 'Тактика маневру']
        }
      ]
    },
    {
      name: '44 ОАБр',
      description: 'Окрема артилерійська бригада імені гетьмана Данила Апостола',
      image: '/images/44.png',
      type: 'сухопутні',
      category: 'артилерія',
      vacancies: [
        {
          title: 'Стрілець',
          image: '/images/vacancies/strilets.jpg',
          duties: [
            'Участь у бойових операціях',
            'Підтримка бойового порядку',
            'Виконання наказів командирів'
          ],
          requirements: ['Відмінна фізична форма', 'Дисципліна'],
          qualifications: ['Військова підготовка'],
          knowledge: ['Стрільба зі стрілецької зброї', 'Тактика']
        }
      ]
    }
    
  ],

  'ok-pivnich': [
    {
      name: '72 ОМБр',
      description: 'Окрема механізована бригада імені Чорних Запорожців.',
      image: '/images/72.png',
      type: 'сухопутні',
      category: 'механізована',
      vacancies: [
        {
          title: 'Стрілець',
          image: '/images/vacancies/strilets.jpg',
          duties: ['Участь у бойових діях', 'Охорона позицій', 'Виконання наказів командирів'],
          requirements: ['Фізична витривалість', 'Дисципліна'],
          qualifications: ['Базова військова підготовка'],
          knowledge: ['Стрілецька зброя', 'Основи тактики']
        }
      ]
    },
    {
      name: '1 ОТБр',
      description: 'Окрема танкова бригада — ударна бронетанкова сила ЗСУ.',
      image: '/images/1otbr.png',
      type: 'сухопутні',
      category: 'танкова',
      vacancies: [
        {
          title: 'Механік-водій танка',
          image: '/images/vacancies/navidnyk.jpg',
          duties: ['Управління танком у бою', 'Обслуговування техніки'],
          requirements: ['Технічна підготовка', 'Стійкість до стресу'],
          qualifications: ['Курс механіка-водія'],
          knowledge: ['Будова танка', 'Тактика танкових підрозділів']
        }
      ]
    },
    {
      name: '26 ОАБр',
      description: 'Окрема артилерійська бригада, потужна вогнева підтримка.',
      image: '/images/26abr.png',
      type: 'сухопутні',
      category: 'артилерія',
      vacancies: [
        {
          title: 'Номер обслуги гармати',
          image: '/images/vacancies/navidnyk.jpg',
          duties: ['Підготовка до стрільби', 'Заряджання гармати', 'Підтримка боєприпасами'],
          requirements: ['Фізична витривалість', 'Командна робота'],
          qualifications: ['Артилерійська підготовка'],
          knowledge: ['Типи боєприпасів', 'Тактика вогневої підтримки']
        }
      ]
    }
  ],
  'ok-pivden': [
    {
      name: '28 ОМБр',
      description: 'Окрема механізована бригада імені Лицарів Зимового Походу.',
      image: '/images/28ombr.png',
      type: 'сухопутні',
      category: 'механізована',
      vacancies: [
        {
          title: 'Гранатометник',
          image: '/images/vacancies/granatometnyk.jpg',
          duties: ['Знищення бронетехніки противника', 'Участь у штурмових діях'],
          requirements: ['Влучність', 'Холоднокровність'],
          qualifications: ['Підготовка з ПТРЗ'],
          knowledge: ['Типи гранатометів', 'Техніка прицілювання']
        }
      ]
    },
    {
      name: '40 ОАБр',
      description: 'Окрема артилерійська бригада, озброєна сучасними системами залпового вогню.',
      image: '/images/40abr.png',
      type: 'сухопутні',
      category: 'артилерія',
      vacancies: [
        {
          title: 'Артилерист-навідник',
          image: '/images/vacancies/navidnyk.jpg',
          duties: ['Наведення гармати на ціль', 'Взаємодія з командиром батареї'],
          requirements: ['Точність', 'Технічне мислення'],
          qualifications: ['Артилерійський курс'],
          knowledge: ['Оптика і прицілювання', 'Вогнева підтримка']
        }
      ]
    }
  ],  
  

  'center': [
    {
      name: 'Станція радіолокації "Центр"',
      description: 'Основна радіолокаційна станція Повітряних сил України в центрі країни.',
      image: '/images/air-center.png',
      type: 'повітряні сили',
      category: 'радіолокація',
      vacancies: [
        {
          title: 'Оператор РЛС',
          image: '/images/vacancies/rls_operator.jpg',
          duties: [
            'Моніторинг повітряного простору',
            'Виявлення ворожих об’єктів',
            'Передача інформації в командний центр'
          ],
          requirements: ['Технічна освіта', 'Уважність'],
          qualifications: ['Курс оператора РЛС'],
          knowledge: ['Радіолокація', 'Сигналізація']
        }
      ]
    }
  ],

  'zakhid': [
    {
      name: '114 окрема бригада тактичної авіації',
      description: 'Бригада тактичної авіації Повітряних сил на заході України.',
      image: '/images/air-zakhid-brigade.png',
      type: 'повітряні сили',
      category: 'тактична авіація',
      vacancies: [
        {
          title: 'Пілот винищувача',
          image: '/images/vacancies/pilot.jpg',
          duties: [
            'Ведення повітряного бою',
            'Патрулювання повітряного простору',
            'Участь в навчаннях та операціях'
          ],
          requirements: ['Відмінне здоров’я', 'Високий рівень підготовки'],
          qualifications: ['Курс пілота-винищувача'],
          knowledge: ['Авіаційна техніка', 'Тактика повітряного бою']
        }
      ]
    }
    
  ],

  'pivden': [
    {
      name: '10 окрема бригада тактичної авіації',
      description: 'Бригада тактичної авіації Повітряних сил на півдні України.',
      image: '/images/air-pivden-brigade.png',
      type: 'повітряні сили',
      category: 'тактична авіація',
      vacancies: [
        {
          title: 'Технік авіаційної техніки',
          image: '/images/vacancies/aviation_technician.jpg',
          duties: [
            'Обслуговування та ремонт літаків',
            'Підготовка техніки до польотів',
            'Контроль стану обладнання'
          ],
          requirements: ['Технічна освіта', 'Уважність'],
          qualifications: ['Курс авіаційного техніка'],
          knowledge: ['Авіаційні системи', 'Безпека польотів']
        }
      ]
    }
  ],

  'skhid': [
    {
      name: '7 окрема авіаційна бригада',
      description: 'Авіаційна бригада Повітряних сил у східному регіоні.',
      image: '/images/air-skhid-brigade.png',
      type: 'повітряні сили',
      category: 'авіація',
      vacancies: [
        {
          title: 'Інженер авіації',
          image: '/images/vacancies/aviation_technician.jpg',
          duties: [
            'Технічне обслуговування авіатехніки',
            'Планування ремонтних робіт',
            'Контроль якості робіт'
          ],
          requirements: ['Інженерна освіта', 'Досвід роботи'],
          qualifications: ['Курс інженера авіації'],
          knowledge: ['Авіаційні системи', 'Безпека польотів']
        }
      ]
    }
  ],

  // Військово-морські сили
  'vms': [
    {
      name: '15 окрема морська бригада',
      description: 'Ключова бригада Військово-морських сил України.',
      image: '/images/15.png',
      type: 'морські',
      category: 'морська піхота',
      vacancies: [
        {
          title: 'Морський піхотинець',
          image: '/images/vacancies/morsky_pihotynets.jpg',
          duties: [
            'Захист прибережної зони',
            'Десантування та штурм',
            'Патрулювання морського узбережжя'
          ],
          requirements: ['Фізична витривалість', 'Вміння плавати'],
          qualifications: ['Курс морського піхотинця'],
          knowledge: ['Тактика морського бою', 'Водолазна справа']
        }
      ]
    }
  ],

  'mp': [
    {
      name: '36 окрема морська піхотна бригада',
      description: 'Морська піхота ВМС України.',
      image: '/images/36.png',
      type: 'морські',
      category: 'морська піхота',
      vacancies: [
        {
          title: 'Снайпер морської піхоти',
          image: '/images/vacancies/morsky_pihotynets.jpg',
          duties: [
            'Прицільне ураження цілей',
            'Розвідка',
            'Підтримка штурмових груп'
          ],
          requirements: ['Висока концентрація', 'Відмінна фізична форма'],
          qualifications: ['Курс снайпера'],
          knowledge: ['Оптика', 'Тактика бою']
        }
      ]
    }
  ],

  'flot': [
    {
      name: 'Перший флот ВМС України',
      description: 'Основні бойові кораблі ВМС.',
      image: '/images/flot_1.png',
      type: 'морські',
      category: 'флот',
      vacancies: [
        {
          title: 'Корабельний механік',
          image: '/images/vacancies/ship_mechanic.jpg',
          duties: [
            'Обслуговування двигунів корабля',
            'Ремонт техніки',
            'Технічний контроль'
          ],
          requirements: ['Технічна освіта', 'Досвід роботи на морі'],
          qualifications: ['Курс корабельного механіка'],
          knowledge: ['Морська техніка', 'Безпека корабля']
        }
      ]
    }
  ],

  'bo': [
    {
      name: 'Берегова охорона Чорного моря',
      description: 'Підрозділ берегової охорони ВМС.',
      image: '/images/flot_1.png',
      type: 'морські',
      category: 'берегова охорона',
      vacancies: [
        {
          title: 'Офіцер берегової охорони',
          image: '/images/vacancies/officer.jpg',
          duties: [
            'Патрулювання берегової лінії',
            'Боротьба з контрабандою',
            'Охорона портів'
          ],
          requirements: ['Військова освіта', 'Відповідальність'],
          qualifications: ['Курс офіцера берегової охорони'],
          knowledge: ['Законодавство', 'Тактика патрулювання']
        }
      ]
    }
  ]

};

export default brigadesByCommand;
